aisumegane/PIC16F1827_copy_remote_controller.X/register_setup.c
/*
 * File:   register_setup.c
 * Author: 氷MEGANE
 *
 * Created on 2024/03/27, 21:17
 */


#include <xc.h>
#include <pic16f1827.h>

/*header*/
#include "grobal_macro.h"

#include "register_setup.h"



typedef union {
    struct {    /*定義順序注意(下位bitから詰める)*/
        unsigned char low_ccp1x          :1; /*bit 0     */
        unsigned char low_ccp1y          :1; /*bit 1     */
        unsigned char high_8bit          :8; /*bit 2?9  */
        unsigned char unusebit           :6; /*bit 10?15*/
    }bit_field;
    
    unsigned short u_short_pwm_duty;
} DUTY_REG_SET;


/**/
unsigned char register_setup_timer1_capture_edge;

/*global func prototype*/
void pic819_register_setup_byte_set(void);
void pic819_register_setup(void);

void oscillator_setup(void);
void option_reg_setup(void);
void apfcon_reg_setup(void);
void interrupt_setup(void);
void io_port_setup(void);
void ad_converter_setup(void);

void timer0_setup(void);
void timer1_setup(void);
void timer2_pwm_mode_setup(void);
void set_pwm_duty(unsigned short duty);

void gf_enable_timer0_interrupt(void);
void gf_disable_timer0_interrupt(void);

void timer1_compare_mode_setup(void);
void timer1_capture_mode_setup(void);

void gf_enable_ccp1_interrupt(void);
void gf_disable_ccp1_interrupt(void);

void gf_enable_timer1_interrupt(void);
void gf_disable_timer1_interrupt(void);

void rs_ccp2_set_pwmduty_8bit(unsigned char duty);
void rs_ccp2_set_carrier_freq_8bit(unsigned char carrier_freq);



void timer1_capture_mode_edge_select(unsigned char edge_select);


/*global func*/
void rs_enable_interrupt(void);    /*割込み許可関数*/
void rs_disable_interrupt(void);   /*割込み禁止関数*/
void gf_timer1_start(void);        /*timer1 動作開始関数*/
void gf_timer1_stop(void);         /*timer1 動作停止関数*/
void gf_timer2_start(void);
void gf_timer2_stop(void);

void gf_option_integ_edge_select(unsigned char edge_state);



void pic819_register_setup(void)
{         
    /*割込み禁止*/
    INTCONbits.GIE = CLEAR;         // グローバル割り込み禁止
    INTCONbits.PEIE = CLEAR;        // リフェラル割込み禁止
    
    
    oscillator_setup();         /*内蔵発振器設定*/
    option_reg_setup();         /*オプション設定*/
    apfcon_reg_setup();         /*ピン配置設定*/
    interrupt_setup();          /*割込み設定*/
    io_port_setup();            /*IOポート設定*/
    ad_converter_setup();       /*ADコンバータ設定*/
    
    //timer0_setup();             /*timer0設定*/
    //timer1_setup();             /*timer1設定*/
    timer2_pwm_mode_setup();             /*timer2設定*/
    
    //timer1_compare_mode_setup();  
    timer1_capture_mode_setup();    /*timer1(RB0=CCP1) capture mode setup*/
}

void oscillator_setup(void)
{   /*if set to 32MHz, setup with PLLEN(config_bits),IRCF3:0(OSCCON),SPLLEN(OSCCON),FOSC(config_bits)*/
    /* OSCCON */
    OSCCONbits.SPLLEN       = SET;    /*4x PLL is enabled*/
    /*internal osccilator set to 32MHz HF*/ /**/
    OSCCONbits.IRCF3        = SET;
    OSCCONbits.IRCF2        = SET;
    OSCCONbits.IRCF1        = SET;
    OSCCONbits.IRCF0        = CLEAR;
    
    OSCCONbits.SCS1         = CLEAR;
    OSCCONbits.SCS0         = CLEAR;
}

void option_reg_setup(void)
{   /*OPTION_REG*//*datasheet P.19*//*WDTタイマ、ポート初期一部設定*/
    OPTION_REGbits.nWPUEN  = SET;    /* PORT-B Pull-up Enable bit (1:Disable / 0:Enable) */
    OPTION_REGbits.INTEDG  = SET;      /* RB0/INT pin Interrupt Edge Select bit (1:rising edge / 0:falling edge) */ /* 初回は信号待ち(0→1待ち)なので立ち上がりエッジ */
    OPTION_REGbits.TMR0CS  = CLEAR;    /* TMR0 Clock Source Select bit (1:T0CKI pin / 0:Internal (CKLO)) */
    OPTION_REGbits.TMR0SE  = CLEAR;    /* TMR0 Source Edge Select bit(1:high-to-low transition on T0CKI / 0:low-to-high transition on T0CKI) */
    OPTION_REGbits.PSA     = CLEAR;    /* Prescaler Assignment bit (1:assigned to WDT / 0:assigned to Timer0) */
    OPTION_REGbits.PS2     = SET;      /* TMR0 Prescaler Rate Select bit (PS2,1,0) */
    OPTION_REGbits.PS1     = SET;
    OPTION_REGbits.PS0     = SET;
}

void apfcon_reg_setup(void)
{
    APFCON0bits.RXDTSEL     = CLEAR;    /*RX/DT function:RB1,RB2 pin selection bit */
    APFCON0bits.SDO1SEL     = CLEAR;    /*ADO1 function:RB1,RB6 pin selection bit*/
    APFCON0bits.SS1SEL      = CLEAR;    /*SS1 function:RB5,RA5 pin selection bit*/
    APFCON0bits.P2BSEL      = CLEAR;    /*P2B function:RB7,RBA6 pin selection bit*/
    APFCON0bits.CCP2SEL     = SET;      /*CCP2/P2A function:RB6,RA7 pin selection bit*/       /*CCP2 set to RA7*/
    APFCON0bits.P1DSEL      = CLEAR;    /*P1D function:RB7.RA6 pin selection bit*/
    APFCON0bits.P1CSEL      = CLEAR;    /*P1C function:RB6,RA7 pin selection bit*/
    APFCON0bits.CCP1SEL     = CLEAR;      /*CCP1/P1A function:RB3,RB0 selection bit*/         /*RB3:CLEAR / RB0:SET*/
    
    APFCON1bits.TXCKSEL     = CLEAR;    /*TXCKSEL pin selection bit*/                       /*TX/CK set to RB2*/
}

void interrupt_setup(void)
{   /*datasheet P.89*/
    
    /*INTCON*/
    INTCONbits.GIE          = CLEAR;    /*割込みベクタが1つしかないのでここ禁止しとくだけにする*/   /*UTF8 - shiftJIS でgitがバグるので英語に直しとく*/
    INTCONbits.PEIE         = CLEAR;
    INTCONbits.TMR0IE       = CLEAR;      /*timer0 overflow interrupt enable bit*/
    INTCONbits.INTE         = CLEAR;      /*int external interrupt enable bit*/     /*conflict with CCP1 capture mode*/
    
    INTCONbits.IOCIE        = CLEAR;    /*interrupt-on-change enable bit:disable*/
    INTCONbits.TMR0IF       = CLEAR;    /*timer0 interrupt overflow flag bit*/
    INTCONbits.INTF         = CLEAR;    /*int external interrupt flag bit*/
    INTCONbits.IOCIF        = CLEAR;    /*interrupt-on-change interrupt flag bit*/
    
    
    /*PIE1*/
    PIE1bits.TMR1GIE        = CLEAR;    /*timer1 gate interrupt enable bit*/
    PIE1bits.ADIE           = CLEAR;    /*A/D converter interrupt enable bit*/
    PIE1bits.RCIE           = CLEAR;    /*USART transmit interrupt enable bit*/
    PIE1bits.TXIE           = CLEAR;    /*USART transmit interrupt enable bit*/
    PIE1bits.SSP1IE         = CLEAR;    /*synchronous serial port1 interrupt enable bit*/
    PIE1bits.CCP1IE         = CLEAR;    /*CCP1 interrupt enable bit*/
    PIE1bits.TMR2IE         = CLEAR;      /*TMR2 to PR2 match interrupt enable bit*/
    PIE1bits.TMR1IE         = CLEAR;    /*timer1 overflow interrupt enable bit*/
    
    /*PIE2*/
    PIE2bits.OSFIE          = CLEAR;    /*oscillator fail interrupt enable bit*/
    PIE2bits.C2IE           = CLEAR;    /*comparator c2 interrupt enable bit*/
    PIE2bits.C1IE           = CLEAR;    /*comparator c1 interrupt enable bit*/
    PIE2bits.EEIE           = CLEAR;    /*EEPROM write completion interrupt enable bit*/
    PIE2bits.BCL1IE         = CLEAR;    /*MSSP1 BUS collision interrupt enable bit*/
    PIE2bits.CCP2IE         = CLEAR;    /*CCP2 interrupt enable bit*/
    
    /*PIE3*/
    PIE3bits.TMR4IE         = CLEAR;    /*CCP4 interrupt enable bit*/
    PIE3bits.CCP3IE         = CLEAR;    /*CCP3 interrupt enable bit*/
    PIE3bits.TMR6IE         = CLEAR;    /*TMR6 to PR6 match interrupt enable bit*/
    PIE3bits.CCP4IE         = CLEAR;    /*TMR4 to PR4 match interrupt enable bit*/
    
