aisumegane/PIC16F1827_copy_remote_controller.X/register_setup.c
    /*PIE4*/
    PIE4bits.BCL2IE         = CLEAR;    /*MSSP2 BUS collision interrupt enable bit*/
    PIE4bits.SSP2IE         = CLEAR;    /*master synchronous serial port 2 interrupt enable bit*/
    
    /*================================================================================================*/

    /*PIR1*/
    PIR1bits.TMR1GIF        = CLEAR;    /*Timer1 gate interrupt flag bit*/
    PIR1bits.ADIF           = CLEAR;    /*A/D converter interrupt flag bit*/
    PIR1bits.RCIF           = CLEAR;    /*USART receive interrupt flag bit*/
    PIR1bits.TXIF           = CLEAR;    /*USART transmit interrupt flag bit*/
    PIR1bits.SSP1IF         = CLEAR;    /*synchronous serial port1 (MSSP1) interrupt flag bit*/
    PIR1bits.CCP1IF         = CLEAR;    /*CCP1 interrupt flag bit*/
    PIR1bits.TMR2IF         = CLEAR;    /*timer2 to PR2 interrupt flag bit*/
    PIR1bits.TMR1IF         = CLEAR;    /*timer1 overflow interrupt flag bit*/
    
    /*PIR2*/
    PIR2bits.OSFIF          = CLEAR;    /*oscillator fail interrupt flag bit*/
    PIR2bits.C2IF           = CLEAR;    /*comparator C2 interrupt flag bit*/
    PIR2bits.C1IF           = CLEAR;    /*comparator C1 interrupt flag bit*/
    PIR2bits.EEIF           = CLEAR;    /*EEPROM Write Completion interrupt flag bit*/
    PIR2bits.BCL1IF         = CLEAR;    /*MSSP1 Bus collision interrupt flag bit*/
    PIR2bits.CCP2IF         = CLEAR;    /*CCP2 interrupt flag bit*/
    
    /*PIR3*/
    PIR3bits.CCP4IF         = CLEAR;    /*CCP4 interrupt flag bit*/
    PIR3bits.CCP3IF         = CLEAR;    /*CCP3 interrupt flag bit*/
    PIR3bits.TMR6IF         = CLEAR;    /*TMR6 to PR6 match interrupt flag bit*/
    PIR3bits.TMR4IF         = CLEAR;    /*TMR4 to PR4 match interrupt flag bit*/
    
    /*PIR4*/
    PIR4bits.BCL2IF         = CLEAR;    /*MSSP2 Bus collision interrupt flag bit*/
    PIR4bits.SSP2IF         = CLEAR;    /*master synchronous serial port 2 (MSSP2) interrupt flag bit*/
}

void io_port_setup(void)
{
#if(PORTMODE == DEBUGBOARD_MODE)
    /*TRISA*/
    TRISAbits.TRISA0 = CLEAR;
    TRISAbits.TRISA1 = CLEAR;
    TRISAbits.TRISA2 = CLEAR;
    TRISAbits.TRISA3 = CLEAR;
    
    TRISAbits.TRISA4 = SET;
    TRISAbits.TRISA5 = SET;
    TRISAbits.TRISA6 = CLEAR;
    TRISAbits.TRISA7 = CLEAR;
    
    /*TRISB*/   /*1:入力 / 0:出力*/
    TRISBbits.TRISB0 = SET;
    TRISBbits.TRISB1 = SET;     /*I2C:SDA*/
    TRISBbits.TRISB2 = SET;
    TRISBbits.TRISB3 = SET;
    
    TRISBbits.TRISB4 = SET;     /*I2C:SCK*/
    TRISBbits.TRISB5 = CLEAR;
    TRISBbits.TRISB6 = SET;
    TRISBbits.TRISB7 = SET;
    
    /*=====================================================*/
    
    /*PORTA*/   /*1:Hレベル出力 / 0:Lレベル出力*/ 
    PORTAbits.RA0 = CLEAR;
    PORTAbits.RA1 = CLEAR;
    PORTAbits.RA2 = CLEAR;
    PORTAbits.RA3 = CLEAR;
    
    PORTAbits.RA4 = CLEAR;
    PORTAbits.RA5 = CLEAR;
    PORTAbits.RA6 = CLEAR;
    PORTAbits.RA7 = CLEAR;
    
    /*PORTB*/   /*1:Hレベル出力 / 0:Lレベル出力*/
    PORTBbits.RB0 = CLEAR;
    PORTBbits.RB1 = CLEAR;
    PORTBbits.RB2 = CLEAR;
    PORTBbits.RB3 = CLEAR;
    
    PORTBbits.RB4 = CLEAR;
    PORTBbits.RB5 = CLEAR;
    PORTBbits.RB6 = CLEAR;
    PORTBbits.RB7 = CLEAR;
    
    /*WPUA*/
    WPUAbits.WPUA5          = CLEAR;    /*weak pull-up RA5 control bit*/
    
    /*WPUB*/
    WPUBbits.WPUB7          = CLEAR;    /*weak pull-up register bits : disabled*/
    WPUBbits.WPUB6          = CLEAR;    /*weak pull-up register bits : disabled*/
    WPUBbits.WPUB5          = CLEAR;    /*weak pull-up register bits : disabled*/
    WPUBbits.WPUB4          = CLEAR;    /*weak pull-up register bits : disabled*/
    
    WPUBbits.WPUB3          = CLEAR;    /*weak pull-up register bits : disabled*/
    WPUBbits.WPUB2          = CLEAR;    /*weak pull-up register bits : disabled*/
    WPUBbits.WPUB1          = CLEAR;    /*weak pull-up register bits : disabled*/
    WPUBbits.WPUB0          = CLEAR;    /*weak pull-up register bits : disabled*/
    
    /*ANSELA*/
    ANSELAbits.ANSA4        = CLEAR;    /*analog / digital mode selection:digital*/
    ANSELAbits.ANSA3        = CLEAR;    /*analog / digital mode selection:digital*/
    ANSELAbits.ANSA2        = CLEAR;    /*analog / digital mode selection:digital*/
    ANSELAbits.ANSA1        = CLEAR;    /*analog / digital mode selection:digital*/
    ANSELAbits.ANSA0        = CLEAR;    /*analog / digital mode selection:digital*/
    
    /*ANSELB*/
    ANSELBbits.ANSB7        = CLEAR;    /*analog / digital mode selection:digital*/
    ANSELBbits.ANSB6        = CLEAR;    /*analog / digital mode selection:digital*/
    ANSELBbits.ANSB5        = CLEAR;    /*analog / digital mode selection:digital*/
    ANSELBbits.ANSB4        = CLEAR;    /*analog / digital mode selection:digital*/
    
    ANSELBbits.ANSB3        = CLEAR;    /*analog / digital mode selection:digital*/
    ANSELBbits.ANSB2        = CLEAR;    /*analog / digital mode selection:digital*/
    ANSELBbits.ANSB1        = CLEAR;    /*analog / digital mode selection:digital*/
    
#else if(PORTMODE == PORTSET_PRINTBOARD_MODE)
    /*TRISA*/
    TRISAbits.TRISA0 = CLEAR;       /*none*/
    TRISAbits.TRISA1 = CLEAR;       /*none*/
    TRISAbits.TRISA2 = SET;         /*SW1:COPY-SW*/
    TRISAbits.TRISA3 = SET;         /*SW2:SEND-SW*/
    
    TRISAbits.TRISA4 = CLEAR;       /*Red LED*/
    TRISAbits.TRISA5 = SET;         /*none(MCLR)*/
    TRISAbits.TRISA6 = CLEAR;       /*none*/
    TRISAbits.TRISA7 = CLEAR;       /*Infrared LED output (CCP2 PWM)*/
    
    /*TRISB*/   /*1:入力 / 0:出力*/
    TRISBbits.TRISB0 = CLEAR;       /*Yellow LED*/
    TRISBbits.TRISB1 = SET;         /*I2C:SDA*/
    TRISBbits.TRISB2 = CLEAR;       /*Green LED*/
    TRISBbits.TRISB3 = SET;         /*photo transistor*/
    
    TRISBbits.TRISB4 = SET;         /*I2C:SCK*/
    TRISBbits.TRISB5 = SET;         /*SW3:freq_change-SW*/
    TRISBbits.TRISB6 = SET;         /*none(PGC)*/
    TRISBbits.TRISB7 = SET;         /*none(PGD)*/
    
    /*=====================================================*/
    
