aisumegane/PIC16F1827_copy_remote_controller.X/register_setup.c
    /*PORTA*/   /*1:Hレベル出力 / 0:Lレベル出力*/ 
    PORTAbits.RA0 = CLEAR;
    PORTAbits.RA1 = CLEAR;
    PORTAbits.RA2 = CLEAR;
    PORTAbits.RA3 = CLEAR;
    
    PORTAbits.RA4 = CLEAR;
    PORTAbits.RA5 = CLEAR;
    PORTAbits.RA6 = CLEAR;
    PORTAbits.RA7 = CLEAR;
    
    /*PORTB*/   /*1:Hレベル出力 / 0:Lレベル出力*/
    PORTBbits.RB0 = CLEAR;
    PORTBbits.RB1 = CLEAR;
    PORTBbits.RB2 = CLEAR;
    PORTBbits.RB3 = CLEAR;
    
    PORTBbits.RB4 = CLEAR;
    PORTBbits.RB5 = CLEAR;
    PORTBbits.RB6 = CLEAR;
    PORTBbits.RB7 = CLEAR;
    
    /*WPUA*/
    WPUAbits.WPUA5          = CLEAR;    /*weak pull-up RA5 control bit*/
    
    /*WPUB*/
    WPUBbits.WPUB7          = CLEAR;    /*weak pull-up register bits : disabled*/
    WPUBbits.WPUB6          = CLEAR;    /*weak pull-up register bits : disabled*/
    WPUBbits.WPUB5          = CLEAR;    /*weak pull-up register bits : disabled*/
    WPUBbits.WPUB4          = CLEAR;    /*weak pull-up register bits : disabled*/
    
    WPUBbits.WPUB3          = CLEAR;    /*weak pull-up register bits : disabled*/
    WPUBbits.WPUB2          = CLEAR;    /*weak pull-up register bits : disabled*/
    WPUBbits.WPUB1          = CLEAR;    /*weak pull-up register bits : disabled*/
    WPUBbits.WPUB0          = CLEAR;    /*weak pull-up register bits : disabled*/
    
    /*ANSELA*/
    ANSELAbits.ANSA4        = CLEAR;    /*analog / digital mode selection:digital*/
    ANSELAbits.ANSA3        = CLEAR;    /*analog / digital mode selection:digital*/
    ANSELAbits.ANSA2        = CLEAR;    /*analog / digital mode selection:digital*/
    ANSELAbits.ANSA1        = CLEAR;    /*analog / digital mode selection:digital*/
    ANSELAbits.ANSA0        = CLEAR;    /*analog / digital mode selection:digital*/
    
    /*ANSELB*/
    ANSELBbits.ANSB7        = CLEAR;    /*analog / digital mode selection:digital*/
    ANSELBbits.ANSB6        = CLEAR;    /*analog / digital mode selection:digital*/
    ANSELBbits.ANSB5        = CLEAR;    /*analog / digital mode selection:digital*/
    ANSELBbits.ANSB4        = CLEAR;    /*analog / digital mode selection:digital*/
    
    ANSELBbits.ANSB3        = CLEAR;    /*analog / digital mode selection:digital*/
    ANSELBbits.ANSB2        = CLEAR;    /*analog / digital mode selection:digital*/
    ANSELBbits.ANSB1        = CLEAR;    /*analog / digital mode selection:digital*/
#endif
}

void ad_converter_setup(void)
{
    /*ADCON0*/
    ADCON0bits.CHS4         = SET;      /*analog channel select bit*/
    ADCON0bits.CHS3         = SET;      /*no channel connected*/
    ADCON0bits.CHS2         = SET;
    ADCON0bits.CHS1         = CLEAR;
    ADCON0bits.CHS0         = SET;
    
    ADCON0bits.GO_nDONE     = CLEAR;    /*A/D conversion status bit*/
    ADCON0bits.ADON         = CLEAR;    /*ADC enable bit*/
    
    /*ADCON1*/
    ADCON1bits.ADFM         = SET;      /*A/D result format select bit*/ /*右(16bitのうち10bit使用、下位ビット寄せて上位は使わない)*/
    ADCON1bits.ADCS2        = CLEAR;    /*A/D conversion clock select bit*/
    ADCON1bits.ADCS2        = CLEAR;    /*A/D conversion clock select bit*/
    ADCON1bits.ADCS2        = CLEAR;    /*A/D conversion clock select bit*/
    
    ADCON1bits.ADNREF       = CLEAR;    /*A/D negative voltage reference configuration bit*/
    ADCON1bits.ADPREF1      = CLEAR;    /*A/D positive voltage reference configuration bits*/
    ADCON1bits.ADPREF0      = CLEAR;    /*A/D positive voltage reference configuration bits*/
    
    /*ADRESH*/
    ADRESH = CLEAR;                     /*ADC result register bits*/    /*init*/
    
    /*ADRESL*/
    ADRESL = CLEAR;                     /*ADC result register bits*/    /*init*/
    
}

void timer0_setup(void)
{   /*timer0についてはオプションで設定*/
    option_reg_setup();
}


#if 0
void timer1_setup(void)
{
#if 0
    /*CCPモード設定*/
    /*T1CON*/ /*datasheet P.59*/
    /*T1CON*/
    T1CONbits.T1CKPS1 = SET;      /*(Fsoc/4)の8分周 */ /* 2MHz/8 = 250kHz(0.000,004 sec) */
    T1CONbits.T1CKPS0 = SET;
    T1CONbits.T1OSCEN = CLEAR;      /*for external clock*/        
    T1CONbits.nT1SYNC = SET;        /*for external clock*/
    T1CONbits.TMR1CS = CLEAR;       /*Internal clock*/
    T1CONbits.TMR1ON = CLEAR;

    /*CCP1CON*/ /*datasheet P.67*/
    /*CCP1CONbits_t.CCP1X = SET/CLEAR;*/
    /*CCP1CONbits_t.CCP1Y = SET/CLEAR;*/
    CCP1CONbits.CCP1M3 = SET;
    CCP1CONbits.CCP1M2 = CLEAR;
    CCP1CONbits.CCP1M1 = SET;
    CCP1CONbits.CCP1M0 = SET;
    
    /*CCPR1H,CCPR1L*/
    /* 動作周波数設定 = 50ms = 0.000,004 sec * 12500(0x30D4) */
    /* 0までロールオーバー(MAXの次に0を数えて1カウントする)ので、1引く */
    CCPR1H = 0x30;
    CCPR1L = 0xD3;  /* Timer0でも十分 */   
#endif
    /*PWMモード設定*/
    /*T1CON*/ /*datasheet P.59*/
    /*T1CON*/
    T1CONbits.T1CKPS1 = SET;      /*(Fsoc/4)の8分周 */ /* 2MHz/8 = 250kHz(0.000,004 sec) */
    T1CONbits.T1CKPS0 = SET;
    T1CONbits.T1OSCEN = CLEAR;      /*for external clock*/        
    T1CONbits.nT1SYNC = SET;        /*for external clock*/
    T1CONbits.TMR1CS = CLEAR;       /*Internal clock*/
    T1CONbits.TMR1ON = CLEAR;

    /*CCP1CON*/ /*datasheet P.67*/
    /*CCP1CONbits_t.CCP1X = SET/CLEAR;*/
    /*CCP1CONbits_t.CCP1Y = SET/CLEAR;*/
    CCP1CONbits.CCP1M3 = SET;
    CCP1CONbits.CCP1M2 = SET;
    CCP1CONbits.CCP1M1 = SET;   /*無効*/
    CCP1CONbits.CCP1M0 = SET;   /*無効*/
    
    /*CCPR1H,CCPR1L*/
    /* 動作周波数設定 = 50ms = 0.000,004 sec * 12500(0x30D4) */
    /* 0までロールオーバー(MAXの次に0を数えて1カウントする)ので、1引く */
    //CCPR1H = 0x30;  
    

#if 1
    CCPR1L = 0x11;
    CCP1CONbits.CCP1X = CLEAR;
    CCP1CONbits.CCP1Y = CLEAR;
#else
    set_pwm_duty(100);
#endif
}

#endif

void timer1_compare_mode_setup(void)
{   /*compareモード設定*/
    /*T1CON*/
    T1CONbits.TMR1CS1       = CLEAR;    /*timer1 clock source select bits*/ /*Fosc/4*/
    T1CONbits.TMR1CS0       = CLEAR;    /*timer1 clock source select bits*/
    
    T1CONbits.T1CKPS1       = SET;      /*timer1 input clock prescale select bits*/
    T1CONbits.T1CKPS0       = SET;      /*(Fsoc/4)の8分周 */ /* 8MHz/8 = 1MHz(0.000,001 sec) */
    
    T1CONbits.T1OSCEN       = CLEAR;    /*LP oscillator enable control bit*/
    T1CONbits.nT1SYNC       = SET;      /*timer1 external clock input synchronization control bit*/
    T1CONbits.TMR1ON        = CLEAR;    /*timer1 on bit*/

    T1GCONbits.TMR1GE       = CLEAR;    /*timer1 gate enable bit*/
    T1GCONbits.T1GPOL       = SET;      /*timer1 gate polarity bit*/
    T1GCONbits.T1GTM        = CLEAR;    /*timer1 gate toggle mode bit*/ /*disable*/
    T1GCONbits.T1GSPM       = CLEAR;    /*timer1 gate single-pulse mode bit*/
    T1GCONbits.T1GGO        = CLEAR;    /*timer1 gate single-pulse acquisition status bit*/
/*  T1GCONbits.T1GVAL       = CLEAR;*/  /*timer1 gate current state bit*/    /*!read only!*/
    T1GCONbits.T1GSS1       = CLEAR;    /*timer1 gate source select bits*/  /*timer0 overflow output*/
    T1GCONbits.T1GSS0       = CLEAR;    /*timer1 gate source select bits*/
    
    /*CCP1CON*/
    CCP1CONbits.P1M1        = CLEAR;    /*enhanced PWM output configuration bits*/
    CCP1CONbits.P1M0        = CLEAR;    /*enhanced PWM output configuration bits*/  /*single output*/
    
    CCP1CONbits.DC1B1       = CLEAR;    /*PWM Duty cycle least significant bits*/
    CCP1CONbits.DC1B0       = CLEAR;    /*PWM Duty cycle least significant bits*/   /*if caputure/compare mode, unused*/
    
    CCP1CONbits.CCP1M3      = SET;      /*ECCPx mode select bits*/  /*compare mode: generate software interrupt only*/
    CCP1CONbits.CCP1M2      = CLEAR;
    CCP1CONbits.CCP1M1      = SET;
    CCP1CONbits.CCP1M0      = CLEAR;
    
    
    
            
    /*CCPR1H,CCPR1L*/
    /* 動作周波数設定 = 50ms = 0.000,004 sec * 25000(0x61AB) */
    /* 0までロールオーバー(MAXの次に0を数えて1カウントする)ので、1引く */
    CCPR1H = 0xFF;
    CCPR1L = 0xFF;  /* Timer0でも十分 */   
}

