aisumegane/PIC16F1827_copy_remote_controller.X/register_setup.c
void timer1_capture_mode_setup(void)
{   /*captureモード設定*/
    /*T1CON*/
    T1CONbits.TMR1CS1       = CLEAR;    /*timer1 clock source select bits*/ /*Fosc/4*/
    T1CONbits.TMR1CS0       = CLEAR;    /*timer1 clock source select bits*/
    
    T1CONbits.T1CKPS1       = SET;      /*timer1 input clock prescale select bits*/
    T1CONbits.T1CKPS0       = SET;      /*(Fsoc/4)の8分周 */ /* 8MHz/8 = 1MHz(0.000,001 sec) */
    
    T1CONbits.T1OSCEN       = CLEAR;    /*LP oscillator enable control bit*/
    T1CONbits.nT1SYNC       = SET;      /*timer1 external clock input synchronization control bit*/
    T1CONbits.TMR1ON        = CLEAR;    /*timer1 on bit*/

    T1GCONbits.TMR1GE       = CLEAR;    /*timer1 gate enable bit*/
    T1GCONbits.T1GPOL       = SET;      /*timer1 gate polarity bit*/
    T1GCONbits.T1GTM        = CLEAR;    /*timer1 gate toggle mode bit*/ /*disable*/
    T1GCONbits.T1GSPM       = CLEAR;    /*timer1 gate single-pulse mode bit*/
    T1GCONbits.T1GGO        = CLEAR;    /*timer1 gate single-pulse acquisition status bit*/
/*  T1GCONbits.T1GVAL       = CLEAR;*/  /*timer1 gate current state bit*/    /*!read only!*/
    T1GCONbits.T1GSS1       = CLEAR;    /*timer1 gate source select bits*/  /*timer0 overflow output*/
    T1GCONbits.T1GSS0       = CLEAR;    /*timer1 gate source select bits*/
    
    /*CCP1CON*/
    CCP1CONbits.P1M1        = CLEAR;    /*enhanced PWM output configuration bits*/
    CCP1CONbits.P1M0        = CLEAR;    /*enhanced PWM output configuration bits*/  /*single output*/
    
    CCP1CONbits.DC1B1       = CLEAR;    /*PWM Duty cycle least significant bits*/
    CCP1CONbits.DC1B0       = CLEAR;    /*PWM Duty cycle least significant bits*/   /*if caputure/compare mode, unused*/
#if 1
    CCP1CONbits.CCP1M3      = SET;      /*ECCPx mode select bits*/  /*compare mode: generate software interrupt only*/
    CCP1CONbits.CCP1M2      = CLEAR;
    CCP1CONbits.CCP1M1      = SET;
    CCP1CONbits.CCP1M0      = CLEAR;
#endif
    
    timer1_capture_mode_edge_select(CAPTURE_RISING_EDGE);

    /*CCPR1H,CCPR1L*/   /*capture data save register*/
    CCPR1H = 0x00;      /*initialize*/
    CCPR1L = 0x00;      /*initialize*/
}

void timer1_capture_mode_edge_select(unsigned char edge_select)
{
    if(edge_select == CAPTURE_RISING_EDGE)
    {
        CCP1CONbits.CCP1M3      = CLEAR;      /*ECCPx mode select bits*/  /*capture mode:every rising edge*/
        CCP1CONbits.CCP1M2      = SET;
        CCP1CONbits.CCP1M1      = CLEAR;
        CCP1CONbits.CCP1M0      = SET;
        register_setup_timer1_capture_edge  = SET;
    }
    else /*edge_select == CCAPTURE_FALLING_EDGE;*/
    {
        CCP1CONbits.CCP1M3      = CLEAR;      /*ECCPx mode select bits*/  /*capture mode:every falling edge*/
        CCP1CONbits.CCP1M2      = SET;
        CCP1CONbits.CCP1M1      = CLEAR;
        CCP1CONbits.CCP1M0      = CLEAR;
        register_setup_timer1_capture_edge  = CLEAR;
    }

}


void timer2_pwm_mode_setup()
{
    CCP2CONbits.P2M1        = CLEAR;
    CCP2CONbits.P2M0        = CLEAR;
    
//  CCP2CONbits.DC2B1       = CLEAR;
//  CCP2CONbits.DC2B0       = CLEAR;
    
    CCP2CONbits.CCP2M3      = SET;      /*PWM mode*/
    CCP2CONbits.CCP2M2      = SET;
    CCP2CONbits.CCP2M1      = CLEAR;
    CCP2CONbits.CCP2M0      = CLEAR;
    
    
    T2CONbits.T2OUTPS3   = CLEAR;   /*postscale:1:1*/
    T2CONbits.T2OUTPS2   = CLEAR;
    T2CONbits.T2OUTPS1   = CLEAR;
    T2CONbits.T2OUTPS0   = CLEAR;
    
    T2CONbits.T2CKPS1   = CLEAR;      /*prescale=1:1  = (32/4)/1 = 8MHz*/
    T2CONbits.T2CKPS0   = CLEAR;
    
    
    /*PWM周期(period)設定：210カウント:約38kHz*/
    rs_ccp2_set_carrier_freq_8bit(0xCA);
    
    //CCPR2L =0x46;
    CCPR2L =0x00;
    
    /*ここの10bit拡張がいまいちわからない*/
    CCP2CONbits.DC2B1 = CLEAR;
    CCP2CONbits.DC2B0 = CLEAR;
    
    T2CONbits.TMR2ON = CLEAR;
    //T2CONbits.TMR2ON = CLEAR;
}

void set_pwm_duty(unsigned short duty)
{   /*0x0000 ? 0x03FF の範囲でduty指定*/
    DUTY_REG_SET pwm_duty;
    
    /*on-dutyを10bitで設定する:上位8bitがCCPR1L、下位2bitがCCP1XとCCP1L、なかなかキモイ*/
#if 0
    duty >>1;
    CCPR1L = (unsigned char)duty;
    CCP1CONbits.CCP1X = CLEAR;
    CCP1CONbits.CCP1Y = CLEAR;
#endif
    
#if 0
    if(duty > 0x3FF)
    {   /*オーバーフロー防止*/
        duty = 0x3FF;
    }
    
    //duty = duty << 2;
    
    /* 100%duty = 0x3FF (10bit MAX) */
    pwm_duty.u_short_pwm_duty = duty;
            
    CCPR1L = pwm_duty.bit_field.high_8bit;
    CCP1CONbits.CCP1X = pwm_duty.bit_field.low_ccp1x;
    CCP1CONbits.CCP1Y = pwm_duty.bit_field.low_ccp1y;
#endif
#if 0
    CCP1CONbits.CCP1X = duty & 0b0000000000000001;
    CCP1CONbits.CCP1Y = duty & 0b0000000000000010;
    
    CCPR1L = duty > 2;
#endif
}

void rs_enable_interrupt(void)
{   /*interrup.cでは使えない(リエントラント?)*/
    INTCONbits.GIE = SET;         // グローバル割り込み許可
    INTCONbits.PEIE = SET;        // リフェラル割込み許可 
}

void rs_disable_interrupt(void)
{   /*interrupt.cでは使えない(リエントラント?)*/
    INTCONbits.GIE = CLEAR;         // グローバル割り込み禁止
    INTCONbits.PEIE = CLEAR;        // リフェラル割込み禁止
}

void gf_enable_ccp1_interrupt(void)
{
    PIE1bits.CCP1IE         = SET;      /*CCP1 interrupt enable bit*/
}

void gf_disable_ccp1_interrupt(void)
{
    PIE1bits.CCP1IE         = CLEAR;    /*CCP1 interrupt enable bit*/
}

void gf_enable_timer1_interrupt(void)
{
    PIE1bits.TMR1IE         = SET;      /*timer1 overflow interrupt enable bit*/
}

void gf_disable_timer1_interrupt(void)
{
    PIE1bits.TMR1IE         = CLEAR;    /*timer1 overflow interrupt enable bit*/
}


void gf_enable_timer0_interrupt(void)
{
    INTCONbits.TMR0IE         = SET;      /*timer1 overflow interrupt enable bit*/
}

void gf_disable_timer0_interrupt(void)
{
    INTCONbits.TMR0IE         = CLEAR;    /*timer1 overflow interrupt enable bit*/
}


void gf_timer1_start(void)
{   /*初回起動で割込み要求等がないか確認すること*/
    T1CONbits.TMR1ON = SET;
}

void gf_timer1_stop(void)
{   /*初回起動で割込み要求等がないか確認すること*/
    T1CONbits.TMR1ON = CLEAR;
}

void gf_timer2_start()
{
    T2CONbits.TMR2ON = SET;
}

void gf_timer2_stop()
{
    T2CONbits.TMR2ON = CLEAR;
}

void rs_ccp2_set_pwmduty_8bit(unsigned char duty)
{
    CCPR2L = duty;
}

void rs_ccp2_set_carrier_freq_8bit(unsigned char carrier_freq)
{
    PR2 = carrier_freq;
}

void gf_option_integ_edge_select(unsigned char edge_state)
{
    if(edge_state == SET)
    {
        OPTION_REGbits.INTEDG  = SET;      /* RB0/INT pin Interrupt Edge Select bit (1:rising edge / 0:falling edge) */ /* 初回は信号待ち(0→1待ち)なので立ち上がりエッジ */
    }
    else if(edge_state == CLEAR)
    {
        OPTION_REGbits.INTEDG  = CLEAR;
    }
}